"""Даны два кортежа. Создайте третий кортеж, который будет
включать в себя элементы первого и второго"""

tuple_1 = (1, 2, 3)
tuple_2 = (4, 5, 6)
print("ПЕРВЫЙ КОРТЕЖ", tuple_1)
print("ВТОРОЙ КОРТЕЖ", tuple_2)
tuple_3 = tuple_1 + tuple_2
print("ОБЪЕДЕНЕННЫЙ КОРТЕЖ: ", tuple_3)
